/**
 * @type {I18n}
 */
export default {
  env: {
    'system_init_message': 'Ви - корисний помічник',
  },
  utils: {
    'not_supported_configuration': 'Непідтримувана конфігурація або помилка типу даних',
  },
  message: {
    'loading': 'Завантаження',
    'not_supported_chat_type': (type) => `Наразі не підтримується ${type} тип чату`,
    'not_supported_chat_type_message': 'Наразі не підтримуються повідомлення в не текстовому форматі',
    'handle_chat_type_message_error': (type) => `Помилка обробки ${type} типу повідомлень у чаті`,
    'user_has_no_permission_to_use_the_bot': (id) => `У вас немає дозволу на використання цього бота, зверніться до адміністратора, щоб додати ваш ID (${id}) до білого списку`,
    'group_has_no_permission_to_use_the_bot': (id) => `Група не включила дозволи на чат, зверніться до адміністратора, щоб додати ID групи (${id}) до білого списку`,
  },
  command: {
    help: {
      'summary': 'Наразі підтримуються наступні команди:\n',
      'help': 'Отримати допомогу щодо команд',
      'new': 'Розпочати нову розмову',
      'start': 'Отримати свій ID та розпочати нову розмову',
      'img': 'Створити зображення, повний формат команди `/img опис зображення`, наприклад `/img пляж в місячному світлі`',
      'version': 'Отримати поточний номер версії для визначення необхідності оновлення',
      'setenv': 'Встановити конфігурацію користувача, повний формат команди /setenv KEY=VALUE',
      'delenv': 'Видалити конфігурацію користувача, повний формат команди /delenv KEY',
      'usage': 'Отримати поточну статистику використання робота',
      'system': 'Переглянути деяку системну інформацію',
      'role': 'Встановити призначену роль',
      'redo': 'Повторити останню розмову, /redo з модифікованим вмістом або безпосередньо /redo',
      'echo': 'Повторити повідомлення',
      'bill': 'Переглянути поточний рахунок',
    },
    role: {
      'not_defined_any_role': 'Ролі ще не визначені',
      'current_defined_role': (size) => `Наразі визначені наступні ролі (${size}):\n`,
      'help': 'Помилка формату: повний формат команди `/role operation`\n' +
                  'Наразі підтримується наступнe:\n' +
                  ' `/role show` Відобразити наразі визначені ролі.\n' +
                  ' `/role назваролі del` Видалити зазначену роль.\n' +
                  ' `/role назваролі KEY=VALUE` Встановити конфігурацію зазначеної ролі.\n' +
                  '  Наразі підтримуються наступні налаштування:\n' +
                  '   `SYSTEM_INIT_MESSAGE`: Початкове повідомлення\n' +
                  '   `OPENAI_API_EXTRA_PARAMS`: Додаткові параметри API OpenAI, повинні бути JSON',
      'delete_role_success': 'Роль успішно видалена',
      'delete_role_error': (e) => `Помилка видалення ролі: \`${e.message}\``,
      'update_role_success': 'Конфігурацію успішно оновлено',
      'update_role_error': (e) => `Помилка формату конфігурації: \`${e.message}\``,
    },
    img: {
      'help': 'Будь ласка, введіть опис зображення. Повний формат команди `/img ракун кіт`',
    },
    new: {
      'new_chat_start': 'Розпочата нова розмова',
      'new_chat_start_private': (id) => `Розпочата нова розмова, ваш ID (${id})`,
      'new_chat_start_group': (id) => `Розпочата нова розмова, ID групи (${id})`,
    },
    setenv: {
      'help': 'Помилка формату конфігурації: повний формат команди /setenv KEY=VALUE',
      'update_config_success': 'Конфігурацію успішно оновлено',
      'update_config_error': (e) => `Помилка формату конфігурації: ${e.message}`,
    },
    version: {
      'new_version_found': (current, online) => `Знайдена нова версія, поточна версія: ${JSON.stringify(current)}, остання версія: ${JSON.stringify(online)}`,
      'current_is_latest_version': (current) => `Поточна версія є останньою, поточна версія: ${JSON.stringify(current)}`,
    },
    usage: {
      'usage_not_open': 'Наразі статистика використання робота не відкрита',
      'current_usage': '📊 Поточне використання робота\n\nТокени:\n',
      'total_usage': (total) => `- Всього: ${total || 0} токенів\n- Використання на чат: `,
      'no_usage': '- Використання відсутнє',
    },
    permission: {
      'not_authorized': 'Помилка перевірки прав доступу',
      'not_enough_permission': (roleList, chatRole) => `Недостатньо прав, потрібно ${roleList.join(',')}, поточне: ${chatRole}`,
      'role_error': (e) => `Помилка перевірки ролі: ` + e.message,
      'command_error': (e) => `Помилка виконання команди: ${e.message}`,
    },
    bill: {
      'bill_detail': (totalAmount, totalUsage, remaining) => `📊 Використання цього місяця\n\n\t- Сума: $${totalAmount || 0}\n\t- Використання: $${totalUsage || 0}\n\t- Залишилось: $${remaining || 0}`,
    },
  },
};
